W7D2/MusicApp/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def self.find_by_credentials(email,password)
        user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Q5ZTnhXBdZd-6LlUN9VKHQ"], ["updated_at", "2021-08-18 00:57:00.353700"], ["id", 5]]
---
    def reset_session_token!
        # generates random # in Base64 string (length=16) for generating session key in HTTP cookies
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!