W7D2/MusicApp/app/controllers/application_controller.rb

    def current_user
        # return current user
            # finds session token and check if it is equal to cookie's session token
        return nil unless session[:session_token]
        @current_user ||= User.find_by(session_token:session[:session_token])
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "GCqZQwG8vYtqIBF6VAM0WA"], ["LIMIT", 1]]