w6d5/ninetynine_cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    # params = { cats: {name: ''}}
    # params = {}
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    #  find: returns exception if nothing is found & causes error
    #  find_by : returns nil if nothing is found
    @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["birth_date", "2017-05-23"], ["description", "        lovely and friendly\r\n    "], ["updated_at", "2021-08-15 06:51:35.249294"], ["id", 2]]