W6D3/routes_v2/app/controllers/artworks_controller.rb

    def index
        @artwork = Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES (?, ?, ?)  [["title", "Fruits"], ["image_url", "fruits.png"], ["artist_id", 1]]

    def show
        @artwork = Artwork.find_by(id: params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        artwork = Artwork.find_by(id: params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = ?, "image_url" = ?, "artist_id" = ? WHERE "artworks"."id" = ?  [["title", "200"], ["image_url", "200"], ["artist_id", 2], ["id", 6]]

    def destroy
        artwork = Artwork.find_by(id: params[:id])
        if artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = ?  [["id", 2]]