W6D3/routes_v2/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def show
        @artwork = Artwork.find_by(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        artwork = Artwork.find_by(id: params[:id])