W6D3/routes_v2/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES (?, ?)  [["artwork_id", 1], ["viewer_id", 1]]
---
    def create
        artwork_share = ArtworkShare.new(artwork_shares_params)
        if artwork_share.save