W6D3/routes_v2/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
    def index
    case
    when params[:user_id]
      @comments = Comment.where(user_id: params[:user_id])
    when params[:artwork_id]
      @comments = Comment.where(artwork_id: params[:artwork_id])
    else
      @comments = Comment.all

INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES (?, ?, ?)  [["user_id", 1], ["artwork_id", 1], ["body", "This looks nice"]]
---
    def create
        # debugger
        comment = Comment.new(comment_params)
        if comment.save