W6D3/routes_v2/app/controllers/users_controller.rb

    def index
        # users can search for other users by name
        # check if a query is present in the request params.
        @users = User.all
        if params.has_key?("username")
<<<<<<< HEAD
            @users = User.where(username: params[:username])
=======
            @user = User.where(username: params[:username])
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."username" = ?  [["username", "jimmy"]]

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email") VALUES (?, ?)  [["name", "Danny"], ["email", "danny@gmail.com"]]

    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = ? WHERE "users"."id" = ?  [["username", "Johnny"], ["id", 3]]

    def destroy
        user = User.find_by(id: params[:id])
        if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]